In [1]:
import pandas as pd
from typing import List

# Write a solution to calculate the total time in minutes spent by each employee on each day at the office. Note that within one day, an employee can enter and leave more than once. The time spent in the office for a single entry is out_time - in_time.

Return the result table in any order.

In [2]:
data = [
    {"emp_id": 1, "event_day": "2020-11-28", "in_time": 4, "out_time": 32},
    {"emp_id": 1, "event_day": "2020-11-28", "in_time": 55, "out_time": 200},
    {"emp_id": 1, "event_day": "2020-12-03", "in_time": 1, "out_time": 42},
    {"emp_id": 2, "event_day": "2020-11-28", "in_time": 3, "out_time": 33},
    {"emp_id": 2, "event_day": "2020-12-09", "in_time": 47, "out_time": 74},
]

df = pd.DataFrame(data)

In [3]:
def total_time(employees: pd.DataFrame) -> pd.DataFrame:
    new_df=employees.groupby(['emp_id','event_day']).agg('sum').reset_index()
    new_df['total_time']=new_df['out_time']-new_df['in_time']
    new_df.rename(columns={'event_day':'day'},inplace=True)
    return(new_df[['day','emp_id','total_time']])

In [4]:
total_time(df)

          day  emp_id  total_time
0  2020-11-28       1         173
1  2020-12-03       1          41
2  2020-11-28       2          30
3  2020-12-09       2          27

# Write a solution to find the first login date for each player.

Return the result table in any order.

The result format is in the following example.

In [5]:
data = {
    'player_id': [1, 1, 2, 3, 3],
    'device_id': [2, 2, 3, 1, 4],
    'event_date': ['2016-03-01', '2016-05-02', '2017-06-25', '2016-03-02', '2018-07-03'],
    'games_played': [5, 6, 1, 0, 5]
}
df = pd.DataFrame(data)

In [6]:
def game_analysis(activity: pd.DataFrame) -> pd.DataFrame:
    activity.sort_values(by='event_date',inplace=True)
    activity.drop_duplicates(subset='player_id',inplace=True)
    activity.rename(columns={'event_date':'first_login'},inplace=True)
    return(activity[['player_id','first_login']])

In [7]:
game_analysis(df)

   player_id first_login
0          1  2016-03-01
3          3  2016-03-02
2          2  2017-06-25

# Write a solution to calculate the number of bank accounts for each salary category. The salary categories are:

"Low Salary": All the salaries strictly less than $20000.
"Average Salary": All the salaries in the inclusive range [$20000, $50000].
"High Salary": All the salaries strictly greater than $50000.
The result table must contain all three categories. If there are no accounts in a category, return 0.

Return the result table in any order.

In [8]:
data={'account_id':[3,2,8,6],'income': [108939, 12747, 87709, 91796]}
df=pd.DataFrame(data)
df

   account_id  income
0           3  108939
1           2   12747
2           8   87709
3           6   91796

In [9]:
def count_salary_categories(accounts: pd.DataFrame) -> pd.DataFrame:
    def income(sal):
        if sal<20000:
            return 'Low'
        elif 20000<=sal<=50000:
            return 'Average'
        else :
            return 'High'
    accounts['category']=accounts['income'].apply(income)
    accounts['High Salary']=accounts[accounts['category']=='High']['income']
    accounts['Low Salary']=accounts[accounts['category']=='Low']['income']
    accounts['Average Salary']=accounts[accounts['category']=='Average']['income']
    df1=pd.DataFrame({'category':['Low Salary','Average Salary','High Salary']})
    df1['accounts_count']=pd.Series((accounts['Low Salary'].count(),accounts['Average Salary'].count(),accounts['High Salary'].count()))
    return(df1)

In [10]:
count_salary_categories(df)

         category  accounts_count
0      Low Salary               1
1  Average Salary               0
2     High Salary               3

# Write a solution to calculate the number of unique subjects each teacher teaches in the university.

Return the result table in any order.

In [11]:
data = {
    "teacher_id": [1, 1, 1, 2, 2, 2, 2],
    "subject_id": [2, 2, 3, 1, 2, 3, 4],
    "dept_id": [3, 4, 3, 1, 1, 1, 1]
}

df = pd.DataFrame(data)

In [12]:
df.groupby('teacher_id')['subject_id'].nunique().reset_index()

   teacher_id  subject_id
0           1           2
1           2           4

In [13]:
def count_unique_subjects(teacher: pd.DataFrame) -> pd.DataFrame:
    newdf=teacher.groupby(['teacher_id','subject_id']).agg('count').reset_index()
    uniq=newdf['teacher_id'].unique()
    new_df2=newdf['teacher_id'].value_counts().reset_index()
    new_df2.rename(columns={'index':'teacher_id','count':'cnt'},inplace=True)
    return(new_df2)

In [14]:
count_unique_subjects(df)

   teacher_id  teacher_id
0           2           4
1           1           2

# Write a solution to find all the classes that have at least five students.

Return the result table in any order.

In [15]:
data = {
    'student': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I'],
    'class': ['Math', 'English', 'Math', 'Biology', 'Math', 'Computer', 'Math', 'Math', 'Math']
}

df = pd.DataFrame(data)

In [16]:
def find_classes(courses: pd.DataFrame) -> pd.DataFrame:
    courses1=courses.groupby('class').count().reset_index()
    return(courses1[courses1['student']>=5][['class']])

In [17]:
find_classes(df)

  class
3  Math

# Write a solution to find the customer_number for the customer who has placed the largest number of orders.

The test cases are generated so that exactly one customer will have placed more orders than any other customer.

In [18]:
data = {
    'order_number': [1, 2, 3, 4],
    'customer_number': [1, 2, 3, 3]
}

df = pd.DataFrame(data)
df

   order_number  customer_number
0             1                1
1             2                2
2             3                3
3             4                3

In [19]:
def largest_orders(orders: pd.DataFrame) -> pd.DataFrame:
    newdf=(orders.groupby('customer_number').count().reset_index()).sort_values(by='order_number',ascending=False)[0:1]
    return(newdf[['customer_number']])

In [20]:
largest_orders(df)

   customer_number
2                3